lihaijun7781/Alithings-3.0.0/utility/platform/mcu/stm32l4xx_cube/hal/hw.c
/*
 * Copyright (C) 2015-2017 Alibaba Group Holding Limited
 */

#include <stdio.h>
#include <stdbool.h>
#include <string.h>

#include <k_api.h>
#include "ulog/ulog.h"

#include "aos/hal/timer.h"
#include "network/hal/base.h"
#include <hal/wifi.h>

#include "stm32l4xx_hal.h"


#define TAG "hw"

#define us2tick(us) \
    ((us * RHINO_CONFIG_TICKS_PER_SECOND + 999999) / 1000000)


void hal_reboot(void)
{
    HAL_NVIC_SystemReset();
}

static void _timer_cb(void *timer, void *arg)
{
    timer_dev_t *tmr = arg;
    tmr->config.cb(tmr->config.arg);
}

int32_t hal_timer_init(timer_dev_t *tim)
{
    if (tim->config.reload_mode == TIMER_RELOAD_AUTO) {
        krhino_timer_dyn_create((ktimer_t **)&tim->priv, "hwtmr", _timer_cb,
                                us2tick(tim->config.period), us2tick(tim->config.period), tim, 0);
    }
    else {
        krhino_timer_dyn_create((ktimer_t **)&tim->priv, "hwtmr", _timer_cb,
                                us2tick(tim->config.period), 0, tim, 0);
    }
}

int32_t hal_timer_start(timer_dev_t *tmr)
{
    return krhino_timer_start(tmr->priv);
}


void hal_timer_stop(timer_dev_t *tmr)
{
    krhino_timer_stop(tmr->priv);
    krhino_timer_dyn_del(tmr->priv);
    tmr->priv = NULL;
}

#if defined(DEV_SAL_MK3060)
extern hal_wifi_module_t aos_wifi_module_mk3060;
#endif

void hw_start_hal(void)
{
    LOG(">>> start hal");
#if defined(DEV_SAL_MK3060)
    hal_wifi_register_module(&aos_wifi_module_mk3060);
#elif defined DEV_SAL_BK7231
    extern hal_wifi_module_t aos_wifi_module_bk7231;
    hal_wifi_register_module(&aos_wifi_module_bk7231);
#elif defined DEV_SAL_ESP8266_12F
    extern hal_wifi_module_t aos_wifi_module_esp8266_12f;
    hal_wifi_register_module(&aos_wifi_module_esp8266_12f);
#endif
#ifdef AOS_COMP_NETMGR
    hal_wifi_init();
#endif
}
